perf/load_testing/results/ping_results.txt

> perf@1.0.0 artillery
> artillery run load_testing/ping.yaml -e app

Phase started: WarmUp (index: 0, duration: 30s) 15:27:31(-0300)

--------------------------------------
Metrics for period to: 15:27:40(-0300) (width: 8.025s)
--------------------------------------

http.codes.200: ................................................................ 42
http.request_rate: ............................................................. 5/sec
http.requests: ................................................................. 42
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 50
  median: ...................................................................... 3
  p95: ......................................................................... 16
  p99: ......................................................................... 45.2
http.responses: ................................................................ 42
vusers.completed: .............................................................. 42
vusers.created: ................................................................ 42
vusers.created_by_name.Ping (/ping): ........................................... 42
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 5.8
  max: ......................................................................... 102.8
  median: ...................................................................... 11.4
  p95: ......................................................................... 55.2
  p99: ......................................................................... 90.9


--------------------------------------
Metrics for period to: 15:27:50(-0300) (width: 9.519s)
--------------------------------------

http.codes.200: ................................................................ 50
http.request_rate: ............................................................. 5/sec
http.requests: ................................................................. 50
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 38
  median: ...................................................................... 5
  p95: ......................................................................... 30.9
  p99: ......................................................................... 34.1
http.responses: ................................................................ 50
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.Ping (/ping): ........................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 4
  max: ......................................................................... 57
  median: ...................................................................... 15.3
  p95: ......................................................................... 39.3
  p99: ......................................................................... 53


Phase completed: WarmUp (index: 0, duration: 30s) 15:28:01(-0300)

Phase started: Ramp (index: 1, duration: 30s) 15:28:01(-0300)

--------------------------------------
Metrics for period to: 15:28:00(-0300) (width: 9.511s)
--------------------------------------

http.codes.200: ................................................................ 50
http.request_rate: ............................................................. 5/sec
http.requests: ................................................................. 50
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 14
  median: ...................................................................... 3
  p95: ......................................................................... 10.9
  p99: ......................................................................... 13.9
http.responses: ................................................................ 50
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.Ping (/ping): ........................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 3.8
  max: ......................................................................... 42.7
  median: ...................................................................... 8.1
  p95: ......................................................................... 28.5
  p99: ......................................................................... 32.1


--------------------------------------
Metrics for period to: 15:28:10(-0300) (width: 9.85s)
--------------------------------------

http.codes.200: ................................................................ 58
http.request_rate: ............................................................. 6/sec
http.requests: ................................................................. 58
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 18
  median: ...................................................................... 3
  p95: ......................................................................... 13.1
  p99: ......................................................................... 13.9
http.responses: ................................................................ 58
vusers.completed: .............................................................. 58
vusers.created: ................................................................ 58
vusers.created_by_name.Ping (/ping): ........................................... 58
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 3
  max: ......................................................................... 62.8
  median: ...................................................................... 6
  p95: ......................................................................... 23.8
  p99: ......................................................................... 39.3



> perf@1.0.0 artillery
> artillery run load_testing/ping.yaml -e app

Phase started: WarmUp (index: 0, duration: 30s) 15:31:30(-0300)

--------------------------------------
Metrics for period to: 15:31:40(-0300) (width: 8.509s)
--------------------------------------

http.codes.200: ................................................................ 45
http.request_rate: ............................................................. 5/sec
http.requests: ................................................................. 45
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 16
  median: ...................................................................... 3
  p95: ......................................................................... 12.1
  p99: ......................................................................... 15
http.responses: ................................................................ 45
vusers.completed: .............................................................. 45
vusers.created: ................................................................ 45
vusers.created_by_name.Ping (/ping): ........................................... 45
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 4.6
  max: ......................................................................... 45.5
  median: ...................................................................... 10.9
  p95: ......................................................................... 34.1
  p99: ......................................................................... 44.3


--------------------------------------
Metrics for period to: 15:31:50(-0300) (width: 9.512s)
--------------------------------------

http.codes.200: ................................................................ 50
http.request_rate: ............................................................. 5/sec
http.requests: ................................................................. 50
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 32
  median: ...................................................................... 3
  p95: ......................................................................... 19.9
  p99: ......................................................................... 22
http.responses: ................................................................ 50
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.Ping (/ping): ........................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 5
  max: ......................................................................... 34.9
  median: ...................................................................... 9.3
  p95: ......................................................................... 30.9
  p99: ......................................................................... 34.1


Phase completed: WarmUp (index: 0, duration: 30s) 15:32:00(-0300)

Phase started: Ramp (index: 1, duration: 30s) 15:32:00(-0300)

--------------------------------------
Metrics for period to: 15:32:00(-0300) (width: 9.511s)
--------------------------------------

http.codes.200: ................................................................ 50
http.request_rate: ............................................................. 5/sec
http.requests: ................................................................. 50
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 29
  median: ...................................................................... 3
  p95: ......................................................................... 10.9
  p99: ......................................................................... 21.1
http.responses: ................................................................ 50
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.Ping (/ping): ........................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 3.6
  max: ......................................................................... 32.4
  median: ...................................................................... 9.1
  p95: ......................................................................... 23.3
  p99: ......................................................................... 32.1


--------------------------------------
Metrics for period to: 15:32:10(-0300) (width: 9.686s)
--------------------------------------

http.codes.200: ................................................................ 63
http.request_rate: ............................................................. 7/sec
http.requests: ................................................................. 63
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 19
  median: ...................................................................... 4
  p95: ......................................................................... 16
  p99: ......................................................................... 18
http.responses: ................................................................ 63
vusers.completed: .............................................................. 63
vusers.created: ................................................................ 63
vusers.created_by_name.Ping (/ping): ........................................... 63
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 3.4
  max: ......................................................................... 35
  median: ...................................................................... 14.2
  p95: ......................................................................... 29.7
  p99: ......................................................................... 32.8


--------------------------------------
Metrics for period to: 15:32:20(-0300) (width: 9.83s)
--------------------------------------

http.codes.200: ................................................................ 120
http.request_rate: ............................................................. 12/sec
http.requests: ................................................................. 120
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 28
  median: ...................................................................... 3
  p95: ......................................................................... 16
  p99: ......................................................................... 16.9
http.responses: ................................................................ 120
vusers.completed: .............................................................. 120
vusers.created: ................................................................ 120
vusers.created_by_name.Ping (/ping): ........................................... 120
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 3.2
  max: ......................................................................... 37.9
  median: ...................................................................... 6.1
  p95: ......................................................................... 26.3
  p99: ......................................................................... 34.8


Phase completed: Ramp (index: 1, duration: 30s) 15:32:31(-0300)

Phase started: Plain (index: 2, duration: 60s) 15:32:31(-0300)

--------------------------------------
Metrics for period to: 15:32:30(-0300) (width: 9.894s)
--------------------------------------

http.codes.200: ................................................................ 173
http.request_rate: ............................................................. 17/sec
http.requests: ................................................................. 173
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 23
  median: ...................................................................... 3
  p95: ......................................................................... 18
  p99: ......................................................................... 19.9
http.responses: ................................................................ 173
vusers.completed: .............................................................. 173
vusers.created: ................................................................ 173
vusers.created_by_name.Ping (/ping): ........................................... 173
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 3.3
  max: ......................................................................... 63.3
  median: ...................................................................... 11.4
  p95: ......................................................................... 25.8
  p99: ......................................................................... 37.7


--------------------------------------
Metrics for period to: 15:32:40(-0300) (width: 9.886s)
--------------------------------------

http.codes.200: ................................................................ 197
http.request_rate: ............................................................. 20/sec
http.requests: ................................................................. 197
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 32
  median: ...................................................................... 3
  p95: ......................................................................... 18
  p99: ......................................................................... 30.3
http.responses: ................................................................ 197
vusers.completed: .............................................................. 197
vusers.created: ................................................................ 197
vusers.created_by_name.Ping (/ping): ........................................... 197
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 3
  max: ......................................................................... 39.2
  median: ...................................................................... 7.9
  p95: ......................................................................... 32.1
  p99: ......................................................................... 37


--------------------------------------
Metrics for period to: 15:32:50(-0300) (width: 9.886s)
--------------------------------------

http.codes.200: ................................................................ 200
http.request_rate: ............................................................. 20/sec
http.requests: ................................................................. 200
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 32
  median: ...................................................................... 3
  p95: ......................................................................... 13.9
  p99: ......................................................................... 19.1
http.responses: ................................................................ 200
vusers.completed: .............................................................. 200
vusers.created: ................................................................ 200
vusers.created_by_name.Ping (/ping): ........................................... 200
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.7
  max: ......................................................................... 43.7
  median: ...................................................................... 6.2
  p95: ......................................................................... 22
  p99: ......................................................................... 37.7


--------------------------------------
Metrics for period to: 15:33:00(-0300) (width: 9.889s)
--------------------------------------

http.codes.200: ................................................................ 200
http.request_rate: ............................................................. 20/sec
http.requests: ................................................................. 200
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 21
  median: ...................................................................... 3
  p95: ......................................................................... 16.9
  p99: ......................................................................... 21.1
http.responses: ................................................................ 200
vusers.completed: .............................................................. 200
vusers.created: ................................................................ 200
vusers.created_by_name.Ping (/ping): ........................................... 200
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.9
  max: ......................................................................... 43.7
  median: ...................................................................... 6.2
  p95: ......................................................................... 26.8
  p99: ......................................................................... 34.1


--------------------------------------
Metrics for period to: 15:33:10(-0300) (width: 9.886s)
--------------------------------------

http.codes.200: ................................................................ 200
http.request_rate: ............................................................. 20/sec
http.requests: ................................................................. 200
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 30
  median: ...................................................................... 3
  p95: ......................................................................... 16.9
  p99: ......................................................................... 19.9
http.responses: ................................................................ 200
vusers.completed: .............................................................. 200
vusers.created: ................................................................ 200
vusers.created_by_name.Ping (/ping): ........................................... 200
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 3.2
  max: ......................................................................... 38.8
  median: ...................................................................... 6.1
  p95: ......................................................................... 22.9
  p99: ......................................................................... 31.5


--------------------------------------
Metrics for period to: 15:33:20(-0300) (width: 9.879s)
--------------------------------------

http.codes.200: ................................................................ 200
http.request_rate: ............................................................. 20/sec
http.requests: ................................................................. 200
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 23
  median: ...................................................................... 3
  p95: ......................................................................... 15
  p99: ......................................................................... 19.9
http.responses: ................................................................ 200
vusers.completed: .............................................................. 200
vusers.created: ................................................................ 200
vusers.created_by_name.Ping (/ping): ........................................... 200
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.6
  max: ......................................................................... 46.2
  median: ...................................................................... 6.2
  p95: ......................................................................... 22.9
  p99: ......................................................................... 28.5


Phase completed: Plain (index: 2, duration: 60s) 15:33:31(-0300)

Phase started: CoolDown (index: 3, duration: 30s) 15:33:31(-0300)

--------------------------------------
Metrics for period to: 15:33:30(-0300) (width: 9.89s)
--------------------------------------

http.codes.200: ................................................................ 200
http.request_rate: ............................................................. 20/sec
http.requests: ................................................................. 200
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 32
  median: ...................................................................... 4
  p95: ......................................................................... 18
  p99: ......................................................................... 30.3
http.responses: ................................................................ 200
vusers.completed: .............................................................. 200
vusers.created: ................................................................ 200
vusers.created_by_name.Ping (/ping): ........................................... 200
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 3.4
  max: ......................................................................... 40.8
  median: ...................................................................... 9.9
  p95: ......................................................................... 28.5
  p99: ......................................................................... 34.8


--------------------------------------
Metrics for period to: 15:33:40(-0300) (width: 9.713s)
--------------------------------------

http.codes.200: ................................................................ 75
http.request_rate: ............................................................. 8/sec
http.requests: ................................................................. 75
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 20
  median: ...................................................................... 4
  p95: ......................................................................... 13.1
  p99: ......................................................................... 18
http.responses: ................................................................ 75
vusers.completed: .............................................................. 75
vusers.created: ................................................................ 75
vusers.created_by_name.Ping (/ping): ........................................... 75
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.9
  max: ......................................................................... 35
  median: ...................................................................... 7.2
  p95: ......................................................................... 23.8
  p99: ......................................................................... 25.8


--------------------------------------
Metrics for period to: 15:33:50(-0300) (width: 9.657s)
--------------------------------------

http.codes.200: ................................................................ 50
http.request_rate: ............................................................. 5/sec
http.requests: ................................................................. 50
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 30
  median: ...................................................................... 3
  p95: ......................................................................... 13.9
  p99: ......................................................................... 16.9
http.responses: ................................................................ 50
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.Ping (/ping): ........................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 3.4
  max: ......................................................................... 36.6
  median: ...................................................................... 6.9
  p95: ......................................................................... 22
  p99: ......................................................................... 25.8


Phase completed: CoolDown (index: 3, duration: 30s) 15:34:01(-0300)

--------------------------------------
Metrics for period to: 15:34:00(-0300) (width: 9.642s)
--------------------------------------

http.codes.200: ................................................................ 50
http.request_rate: ............................................................. 5/sec
http.requests: ................................................................. 50
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 40
  median: ...................................................................... 3
  p95: ......................................................................... 21.1
  p99: ......................................................................... 32.8
http.responses: ................................................................ 50
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.Ping (/ping): ........................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.8
  max: ......................................................................... 42.1
  median: ...................................................................... 6.9
  p95: ......................................................................... 32.8
  p99: ......................................................................... 35.5


--------------------------------------
Metrics for period to: 15:34:10(-0300) (width: 1.637s)
--------------------------------------

http.codes.200: ................................................................ 10
http.request_rate: ............................................................. 8/sec
http.requests: ................................................................. 10
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 14
  median: ...................................................................... 3
  p95: ......................................................................... 13.9
  p99: ......................................................................... 13.9
http.responses: ................................................................ 10
vusers.completed: .............................................................. 10
vusers.created: ................................................................ 10
vusers.created_by_name.Ping (/ping): ........................................... 10
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 3.9
  max: ......................................................................... 39.7
  median: ...................................................................... 16.3
  p95: ......................................................................... 24.8
  p99: ......................................................................... 24.8


All VUs finished. Total time: 2 minutes, 33 seconds

--------------------------------
Summary report @ 15:34:02(-0300)
--------------------------------

http.codes.200: ................................................................ 1883
http.request_rate: ............................................................. 12/sec
http.requests: ................................................................. 1883
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 40
  median: ...................................................................... 3
  p95: ......................................................................... 16.9
  p99: ......................................................................... 24.8
http.responses: ................................................................ 1883
vusers.completed: .............................................................. 1883
vusers.created: ................................................................ 1883
vusers.created_by_name.Ping (/ping): ........................................... 1883
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.6
  max: ......................................................................... 63.3
  median: ...................................................................... 7.8
  p95: ......................................................................... 27.4
  p99: ......................................................................... 37.7